package lesson7;

/**
 Домашнее задание
 Расширить задачу про котов и тарелки с едой.
 Сделать так, чтобы в тарелке с едой не могло получиться отрицательного количества еды (например, в миске 10 еды, а кот пытается покушать 15-20).
 Каждому коту нужно добавить поле сытость (когда создаем котов, они голодны). Если коту удалось покушать (хватило еды), сытость = true.
 Считаем, что если коту мало еды в тарелке, то он её просто не трогает, то есть не может быть наполовину сыт (это сделано для упрощения логики программы).
 Создать массив котов и тарелку с едой, попросить всех котов покушать из этой тарелки и потом вывести информацию о сытости котов в консоль.
 Добавить в тарелку метод, с помощью которого можно было бы добавлять еду в тарелку.
 **/


public class Homework7 {

    public static void main(String[] args) {

        Cat[] cats  = new Cat[4];
        cats[0] = new Cat("Барсик", 15);
        cats[1] = new Cat("Смешарик", 15);
        cats[2] = new Cat("Рыжик", 15);
        cats[3] = new Cat("Мурзик", 65);

        Plate plate = new Plate(100);

        plate.info();
        cats[0].eat(plate);
        cats[1].eat(plate);
        cats[2].eat(plate);
        cats[3].eat(plate);
        System.out.println("===================");
        for (int i = 0; i<4; i++){
            System.out.println("Аппетит кота: " + cats[i].getName() + " " + cats[i].getAppetite());
        }

        System.out.print("Добавить еды в тарелку? Если да - укажите сколько, если нет - 0: ");

        plate.addFood();

        }
}
